---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.QuitEditMode
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.QuitEditMode

Defines a resolution of a failure by quitting an Edit Mode instead of committing changes.
 Changes made in edit mode will be rolled back.